app/controllers/messages_controller.rb

SELECT "relationships".* FROM "relationships" WHERE "relationships"."friend_id" = $1 AND "relationships"."relationship_status" = $2  [["friend_id", 21], ["relationship_status", 1]]
---
	def new
		@outgoing_message = OutgoingMessage.new
		@relationships = Relationship.where(friend_id: current_user.id, relationship_status: 1)

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "hung1@abc.com"], ["LIMIT", 1]]
INSERT INTO "messages" ("message_type", "content", "user_id", "status", "created_at", "updated_at", "title", "recipient_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def create

		if (!params[:recipients].nil?) && params[:recipients].any? && params[:subject].present? && params[:content].present?
			@recipients = params[:recipients]

			@recipients.each do |recipient|
				@user = User.find_by(email: recipient)
				if @user
					Message.create(message_type: 'TEXT', user_id: current_user.id, recipient_id: @user.id, title: params[:subject], content: params[:content], status: 1)

SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 21]]
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = $1 AND "messages"."recipient_id" = $2 ORDER BY created_at DESC  [["user_id", 22], ["recipient_id", 21]]
---
	def show
		if params[:id]
			puts "current_user.id: "
			puts params[:id].to_s
			# @message_ids = session[:message_recipients].select{|x| x["sender_id"].to_s == params[:id].to_s}

			# MessageRecipient.where(id: @message_ids.collect{|mss| mss["id"]}).update_all(status: 2)

			# @messages_list = Message.where(id: @message_ids.collect{|mss| mss["message_id"]})
			if current_user.id.to_i == params[:id].to_i
				@messages_list = Message.where(user_id: params[:id]).order('created_at DESC')
			else
				@messages_list = Message.where(user_id: params[:id], recipient_id: current_user.id).order('created_at DESC')

SELECT "messages".* FROM "messages" WHERE "messages"."id" = $1 AND "messages"."status" = $2  [["id", 35], ["status", 1]]
UPDATE "messages" SET "status" = $1, "updated_at" = $2 WHERE "messages"."id" = $3  [["status", 2], ["updated_at", 2016-10-21 15:57:28 UTC], ["id", 52]]
---
	def update
		if params[:id]

			Message.where(id: params[:id], status: 1).update(status: 2) #already read the message