app/controllers/relationships_controller.rb

	def new
		@users = User.joins('left join relationships on users.id = relationships.user_id and relationships.friend_id = ' + current_user.id.to_s).where('users.id != ?', current_user.id).select('users.id as id, users.name as name, users.email as email, case when relationships.relationship_status is null then -1 else relationships.relationship_status end as status')
---
SELECT users.id as id, users.name as name, users.email as email, case when relationships.relationship_status is null then -1 else relationships.relationship_status end as status FROM "users" left join relationships on users.id = relationships.user_id and relationships.friend_id = 21 WHERE (users.id != 21)

	def create

		if params[:friend_id]
			@relationship_count = Relationship.where(user_id: current_user.id, friend_id: params[:friend_id]).count
			if @relationship_count == 0
				Relationship.create(user_id: current_user.id, friend_id: params[:friend_id], relationship_status: 0, action: 1)
				Relationship.create(user_id: params[:friend_id], friend_id: current_user.id, relationship_status: 2, action: 1)
			end
		end

		@users = User.joins('left join relationships on users.id = relationships.user_id and relationships.friend_id = ' + current_user.id.to_s).where('users.id != ?', current_user.id).select('users.id as id, users.name as name, users.email as email, case when relationships.relationship_status is null then -1 else relationships.relationship_status end as status')
---
SELECT COUNT(*) FROM "relationships" WHERE "relationships"."user_id" = $1 AND "relationships"."friend_id" = $2  [["user_id", 21], ["friend_id", 23]]
INSERT INTO "relationships" ("user_id", "friend_id", "relationship_status", "action", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 21], ["friend_id", 23], ["relationship_status", 0], ["action", 1], ["created_at", 2016-10-23 02:54:22 UTC], ["updated_at", 2016-10-23 02:54:22 UTC]]
SELECT users.id as id, users.name as name, users.email as email, case when relationships.relationship_status is null then -1 else relationships.relationship_status end as status FROM "users" left join relationships on users.id = relationships.user_id and relationships.friend_id = 21 WHERE (users.id != 21)

	def update
		if params[:id]
			Relationship.where(user_id: current_user.id, friend_id: params[:id]).update(relationship_status: 1)
			Relationship.where(user_id: params[:id], friend_id: current_user.id).update(relationship_status: 1)
			@users = User.joins('left join relationships on users.id = relationships.user_id and relationships.friend_id = ' + current_user.id.to_s).where('users.id != ?', current_user.id).select('users.id as id, users.name as name, users.email as email, case when relationships.relationship_status is null then -1 else relationships.relationship_status end as status')
---
SELECT "relationships".* FROM "relationships" WHERE "relationships"."user_id" = $1 AND "relationships"."friend_id" = $2  [["user_id", 23], ["friend_id", 21]]
UPDATE "relationships" SET "relationship_status" = $1, "updated_at" = $2 WHERE "relationships"."id" = $3  [["relationship_status", 1], ["updated_at", 2016-10-23 03:23:06 UTC], ["id", 8]]
SELECT users.id as id, users.name as name, users.email as email, case when relationships.relationship_status is null then -1 else relationships.relationship_status end as status FROM "users" left join relationships on users.id = relationships.user_id and relationships.friend_id = 20 WHERE (users.id != 20)

	def destroy
		if params[:id]
			Relationship.destroy_all(user_id: current_user.id, friend_id: params[:id])
			Relationship.destroy_all(user_id: params[:id], friend_id: current_user.id)
			@users = User.joins('left join relationships on users.id = relationships.user_id and relationships.friend_id = ' + current_user.id.to_s).where('users.id != ?', current_user.id).select('users.id as id, users.name as name, users.email as email, case when relationships.relationship_status is null then -1 else relationships.relationship_status end as status')
---
DELETE FROM "relationships" WHERE "relationships"."id" = $1  [["id", 3]]
SELECT users.id as id, users.name as name, users.email as email, case when relationships.relationship_status is null then -1 else relationships.relationship_status end as status FROM "users" left join relationships on users.id = relationships.user_id and relationships.friend_id = 21 WHERE (users.id != 21)