app/controllers/users_controller.rb

  def show_message

    @senders = Message.joins("join users on messages.user_id = users.id").select("user_id, users.email as email, users.name as name, sum(case when messages.status = 1 then 1 else 0 end) as count").where(recipient_id: current_user.id).group("messages.user_id, users.email, users.name")
    @messages_list = Message.where(user_id: current_user.id).order('created_at DESC')
---
SELECT COUNT(*) AS count_all, messages.user_id, users.email, users.name AS messages_user_id_users_email_users_name FROM "messages" join users on messages.user_id = users.id WHERE "messages"."recipient_id" = $1 GROUP BY messages.user_id, users.email, users.name  [["recipient_id", 21]]
SELECT user_id, users.email as email, users.name as name, sum(case when messages.status = 1 then 1 else 0 end) as count FROM "messages" join users on messages.user_id = users.id WHERE "messages"."recipient_id" = $1 GROUP BY messages.user_id, users.email, users.name  [["recipient_id", 21]]
SELECT "messages".* FROM "messages" WHERE "messages"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 21]]